blog/what-is-the-difference-between-localhost-vs-127-0-0-1-vs-0-0-0-0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>127.0.0.1 vs localhost vs 0.0.0.0 之间有什么区别</title>
<!-- 2019-11-16 Sat 14:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">127.0.0.1 vs localhost vs 0.0.0.0 之间有什么区别</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 基础概念</a></li>
<li><a href="#sec-2">2. 测试</a></li>
</ul>
</div>
</div>
<p>
前两天问了同事一个问题，我启动了一个8080端口上的服务，是不是不能再启动该端口的服务了。他说当然了，肯定会提示端口占用的。答案是这样吗？我们一起来看下这个问题。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 基础概念</h2>
<div class="outline-text-2" id="text-1">
<p>
localhost 默认绑定在 127.0.0.1， 可从hosts配置文件看出。
</p>

<p>
127.0.0.1 环回地址（loopback）属于A类地址
</p>

<p>
0.0.0.0 对外开放，如果你有个服务，想让外部访问，则可以设置为它，或者也可以指定IP访问。
</p>

<p>
192.168.1.8 路由器分配给的IP，或者说本机网卡获取到的IP。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 测试</h2>
<div class="outline-text-2" id="text-2">
<p>
假如你现在在MAC电脑起了一个Nginx服务，绑定端口8080，这时候，我们可以看到
</p>

<pre class="example">
netstat -a -n | grep -i listen

tcp4       0      0  *.8080                 *.*                    LISTEN
</pre>

<p>
我们从上面可以看到，Nginx绑定在了 *.8080 ，即0.0.0.0.8080。现在我们分别访问
</p>

<pre class="example">
127.0.0.1:8080
0.0.0.0:8080
192.168.1.8:8080
localhost:8080
</pre>

<p>
我们发现这三个地址都可以访问的到。
</p>

<p>
现在我们又准备起一个8080服务，可不可以呢。答案是不可以也可以。这句话怎么讲呢
</p>

<p>
不可以是因为，我们不可以再起一个占用真实网卡的端口，比如192.168.1.8:8080，但我们可以起一个127.0.0.1:8080的服务。
</p>

<p>
通过查询监听端口可得
</p>
<pre class="example">
tcp4       0      0  127.0.0.1.8080         *.*                    LISTEN
</pre>

<p>
我们现在再访问下上面四个地址，看看有没有什么变化。
</p>

<p>
我们发现，以下地址变成了新服务
</p>
<pre class="example">
127.0.0.1:8080
localhost:8080
0.0.0.0:8080
</pre>

<p>
以下地址还是老服务
</p>
<pre class="example">
192.168.1.8:8080
</pre>

<p>
所以，我们可以得出以下结论
</p>

<ul class="org-ul">
<li>localhost 是一个方便输入的字符，是127.0.0.1的映射。另外因为相对输入IP来讲，一个单词或字符会更符合人们的习惯，也更便于记忆。这也就是域名的由来。当然，如果你不喜欢localhost，比如改成cat，也是可以的，随你喜欢。如果你去掉/etc/hosts文件中配置的映射关系，localhost就仅是一个单词。
</li>
<li>在当前上下文中，0.0.0.0 相当于 127.0.0.1，环回地址127.0.01属于最初/终的地址。如果把他想象成一个环，它既是起点，也是终点。
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>